#*************************************************************************
# gem 使用
#*************************************************************************
gem install {name}                              # 安装gem依赖包
gem uninstall {name}                            # 删除gem包
gem uninstall {name} --version '<3.1.2'         # 删除指定版本gem包
gem list {name}                                 # 查看已安装gem包
gem search {name} --remote                      # 查看远端最新版本
gem update {name}                               # 更新gem包


#***************************************************************************************************
# jekyll 安装 
#***************************************************************************************************
gem install jekyll                          # 安装jekyll


#***************************************************************************************************
# bundler 安装 
# !!! 注意3.3.0版本 通过bundler管理依赖 
# 通过 Gemfile &  Gemfile.loc 配置依赖
# 存在 Gemfile 命令加前缀 bundle exec 确保依赖正确性
#***************************************************************************************************
gem install bundler                             # 安装bundler
bundler install                                 # 配置完 Gemfile之后更新安装依赖


#**************************************************************************************************
# jkeyll 基本用法 
#**************************************************************************************************


jekyll build
# 当前文件夹中的内容将会生成到 ./_site 文件夹中

jekyll build --watch
# 当前文件夹中的内容将会生成到 ./_site 文件夹中,查看改变，并且自动再生成

jekyll serve
# 一个开发服务器将会运行在 http://localhost:4000/
# Auto-regeneration（自动再生成文件）: 开启。使用 `--no-watch` 来关闭

jekyll serve --detach
# 功能和`jekyll serve`命令相同，但是会脱离终端在后台运行
# 关闭方法 `kill -9 进程号`  查看进程号 `ps aux | grep jekyll`

jekyll server --no-watch
# 和 `jekyll serve` 一样，但不会监测变化


