#*****************************************************************
# make 安装文件
#*****************************************************************
#./configure 配置
--help                                  #获取帮助
--without                               #使用默认配置
--with                                  #指定配置 
--prefix=PATH                           #指定安装目录
--conf-path=PATH                        #指定配置文件路径
--user=name                             #设置工作进程用户




#*****************************************************************
# nginx
#*****************************************************************
nginx                                   #启动
nginx -s stop                           #关闭
nginx -s reload                         #重启
pkill nginx                             #强制关闭
nginx -t                                #测试配置文件是否正常


#*****************************************************************
# centos 创建网站管理用户
#*****************************************************************
groupadd www                                        #创建用户组
useradd --shell /sbin/nologin -g www www            #创建用户并设置用户组
chown -R wwww:wwww /home/www                        #

